Repository: vshutchenko/ticket-management
Catalog: src/TicketManagement.WebApplication/Resources/Views/Shared/ValidationError.*.resx
Languages: be_by, ru_ru

source: Area description should be unique in the layout.
be_by: Апісанне зоны павінна быць унікальным для лакацыі.
ru_ru: Описание зоны должно быть уникальным для локации.

source: Area is null.
be_by: Зона не знойдзена.
ru_ru: Зона не найдена.

source: Cannot change password.
be_by: Немагчыма змяніць пароль.
ru_ru: Невозможно сменить пароль.

source: Cannot create user.
be_by: Немагчыма стварыць карыстальніка.
ru_ru: Невозможно создать пользователя.

source: Cannot update user.
be_by: Немагчыма абнавіць карыстальніка.
ru_ru: Невозможно обновить пользователя.

source: End date is less than start date.
be_by: Дата заканчэння меншая за дату пачатку.
ru_ru: Дата окончания меньше даты начала.

source: Entity was not found.
be_by: Аб'ект не знойдзены.
ru_ru: Объект не найден.

source: Event cannot be deleted because some seats has already been purchased.
be_by: Падзея не можа быць выдаленая, бо некаторыя месцы ўжо былі набыты.
ru_ru: Событие не может быть удалено, так как некоторые места уже были приобретены.

source: Event in the same layout and the same time is already exists.
be_by: У дадзенай лакацыі ўжо існуе падзея ў абраны час.
ru_ru: В данной локации уже существует событие в выбранное время.

source: Event is null.
be_by: Падзея не знойдзена.
ru_ru: Событие не найдено.

source: Layout is null.
be_by: Лакацыя не знойдзена.
ru_ru: Локация не найдена.

source: No seats chosen.
be_by: Месцы не былі абраныя.
ru_ru: Места не были выбраны.

source: Not valid current password.
be_by: Няправільны сучасны пароль.
ru_ru: Неверный текущий пароль.

source: One or more seats have already been ordered.
be_by: Адно ці больш месцаў ужо былі замоўленыя.
ru_ru: Одно или больше мест уже были заказаны.

source: Price is less than zero.
be_by: Кошт меншы за нуль.
ru_ru: Стоимость меньше нуля.

source: Role was not found.
be_by: Роля не знойдзена.
ru_ru: Роль не найдена.

source: Seat is null.
be_by: Месца не знойдзена.
ru_ru: Место не найдено.

source: Seat with same row and number is already exists in the area.
be_by: Месца з такім самым нумарам ужо існуе ў абранай зоне.
ru_ru: Место с таким же номером уже существует в выбранной зоне.

source: Some seats have already been ordered.
be_by: Некаторыя месцы ўжо былі набыты.
ru_ru: Некоторые места уже были приобретены.

source: Start date is in the past.
be_by: Дата пачатку знаходзіцца ў мінулым.
ru_ru: Дата начала находится в прошлом.

source: The same layout is already exists in current venue.
be_by: Дадзеная лакацыя ўжо існуе ў месцы правядзення.
ru_ru: Данная локация уже существует в месте проведения.

source: There are no available seats in the layout.
be_by: У дадзенай лакацыі няма даступных месцаў.
ru_ru: В данной локации нет доступных мест.

source: This layout cannot be deleted as it will host an event.
be_by: Лакацыя не можа быць выдаленая, бо ў ёй будзе праведзена падзея.
ru_ru: Локация не может быть удалена, так как в ней будет проведено событие.

source: This venue cannot be deleted as it will host an event.
be_by: Месца правядзення не можа быць выдалена, бо ў ім будзе праведзена падзея.
ru_ru: Место проведения не может быть удалено, так как в нем будет проведено событие.

source: User already exists.
be_by: Карыстальнік ужо існуе.
ru_ru: Пользователь уже существует.

source: User was not found.
be_by: Карыстальнік не знойдзены.
ru_ru: Пользователь не найден.

source: User with such email does not exists.
be_by: Карыстальнік з такой поштай не існуе.
ru_ru: Пользователь с такой почтой не существует.

source: Validation error
be_by: Памылка валідацыі
ru_ru: Ошибка валидации

source: Venue is null.
be_by: Месца правядзення не знойдзена.
ru_ru: Место проведения не найдено.

source: Venue with same description is already exists.
be_by: Месца правядзення з такім апісаннем ужо існуе.
ru_ru: Место проведения с таким описанием уже существует.

source: Wrong password.
be_by: Няправільны пароль.
ru_ru: Неверный пароль.

source: Your account has insufficient funds.
be_by: На вашым акаўнце недастаткова сродкаў.
ru_ru: На вашем аккаунте недостаточно средств.
